<template>
	<section class="gal">
		<div class="container">
			<Breadcrumbs :items="items"/>
			<div class="gal__flex">
				<div class="gal__images">
					<div class="gal__mainimage">
						<img v-bind:src="image ? image : images[0]" alt="">
					</div>
					<div class="swiper-container">
						<div class="swiper-wrapper">
							<div class="swiper-slide" v-for="(img, index) in images" v-bind:key="index" v-on:click="image = img">
								<img v-bind:src="img" alt="">
							</div>
						</div>
					</div>
				</div>
				<div class="gal__content">
					<div class="gal__name" v-html="name"></div>
					<div class="html" v-html="html"></div>
				</div>
			</div>
		</div>
	</section>
</template>

<script>
import $ from 'jquery';
import Swiper from 'swiper';
import Breadcrumbs from '~/components/Breadcrumbs';

export default {
	components: {
		Breadcrumbs
	},
	data: function () {
		return {
			image: null,
			images: ["http://mockimage.markello.info/700/640/kazakh", "http://mockimage.markello.info/700/650/kazakh", "http://mockimage.markello.info/600/600/kazakh", "http://mockimage.markello.info/800/640/kazakh", "http://mockimage.markello.info/900/620/kazakh"],
			name: "В Казахстане увеличилось<br> количество предпринимателей",
			items: [{to: "/", text: "Главная"}, {to: "/galery", text: "Галерея выполненых проектов"}],
			html: "<p>г. Павлодар</p><p>С другой стороны дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации новых предложений. Таким образом реализация намеченных плановых заданий требуют от нас анализа соответствующий условий активизации. <br>С другой стороны новая модель организационной деятельности играет важную роль в формировании.</p><p>Разнообразный и богатый опыт реализация намеченных плановых заданий <b>требуют от нас анализа существенных</b> финансовых и административных условий. Повседневная практика показывает, развитие различных форм деятельности представляет собой интересный.</p><p>С другой стороны дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации новых предложений. Таким образом реализация намеченных плановых заданий требуют от нас анализа соответствующий условий активизации. </p> <p>С другой стороны дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации новых предложений. Таким образом реализация намеченных плановых заданий требуют от нас анализа соответствующий условий активизации. </p><p>С другой стороны дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации новых предложений. Таким образом реализация намеченных плановых заданий требуют от нас анализа соответствующий условий активизации. <br>С другой стороны новая модель организационной деятельности играет важную роль в формировании.</p><p>Разнообразный и богатый опыт реализация намеченных плановых заданий <b>требуют от нас анализа существенных</b> финансовых и административных условий. Повседневная практика показывает, развитие различных форм деятельности представляет собой интересный.</p><p>С другой стороны дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации новых предложений. Таким образом реализация намеченных плановых заданий требуют от нас анализа соответствующий условий активизации. </p> <p>С другой стороны дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации новых предложений. Таким образом реализация намеченных плановых заданий требуют от нас анализа соответствующий условий активизации. </p>"
		}
	},
	mounted () {
		var mySwiper = new Swiper ('.gal .swiper-container', {
			slidesPerView: 3,
			spaceBetween: 10
		})
	}
}
</script>

<style lang="scss">
	@import "swiper/dist/css/swiper.min.css";
	@import "~/assets/styles/pages/gal.scss";
</style>